app/controllers/data_uploads_controller.rb

  def create

    @upload_template = UploadTemplate.new(params[:upload_template])
    if !@upload_template.save
---
INSERT INTO `upload_templates` (`name`, `created_at`, `no_errors`, `notes`, `updated_at`, `document`, `status`) VALUES('test 1', '2010-09-08 00:33:59', NULL, NULL, '2010-09-08 00:33:59', 'test1.csv', '0')