app/controllers/upload_templates_controller.rb

  def map_data

    @upload_template = UploadTemplate.find(params[:id])
    @data_columns = @upload_template.data_columns.find(:all, :order => "seq_no")
---
SELECT * FROM `upload_templates` WHERE (`upload_templates`.`id` = 3)
SELECT * FROM `data_columns` WHERE (`data_columns`.upload_template_id = 3) ORDER BY seq_no

  def show
    @upload_template = UploadTemplate.find(params[:id])
    @data_columns = @upload_template.data_columns.find(:all, :order => "seq_no")
---
SELECT * FROM `upload_templates` WHERE (`upload_templates`.`id` = 4)
SELECT * FROM `data_columns` WHERE (`data_columns`.upload_template_id = 4) ORDER BY seq_no

  def edit
    @upload_template = UploadTemplate.find(params[:id])
---
SELECT * FROM `upload_templates` WHERE (`upload_templates`.`id` = 3)

  def create

    @upload_template = UploadTemplate.new(params[:upload_template])
    if !@upload_template.save
---
INSERT INTO `upload_templates` (`name`, `created_at`, `no_errors`, `notes`, `updated_at`, `document`, `status`) VALUES('test 1', '2010-09-08 08:20:07', NULL, NULL, '2010-09-08 08:20:07', 'test1.csv', '0')

  def update

    @upload_template = UploadTemplate.find(params[:id])
    params[:upload_template][:status] = "0"
    params[:upload_template][:no_errors] = 0
    params[:upload_template][:notes] = " "
    if !@upload_template.update_attributes(params[:upload_template])
---
SELECT * FROM `upload_templates` WHERE (`upload_templates`.`id` = 3)
UPDATE `upload_templates` SET `updated_at` = '2010-09-20 19:23:44', `notes` = ' ', `no_errors` = 0, `status` = '0' WHERE `id` = 3

  def destroy
    @upload_template = UploadTemplate.find(params[:id])
    @upload_template.destroy
---
SELECT * FROM `upload_templates` WHERE (`upload_templates`.`id` = 4)
DELETE FROM `upload_templates` WHERE `id` = 4

  def map_input

    session[:data_column] = @column_form = DataColumn.find(params[:id])
---
SELECT * FROM `data_columns` WHERE (`data_columns`.`id` = 57)

  def map_update

    @upload_msg = nil
    @column_form = DataColumn.find(session[:data_column].id)
    @column_form.app_table = session[:data_column].app_table
    @column_form.app_column = session[:data_column].app_column
    @column_form.data_type_name = session[:data_type_name]
    @column_form.data_type_id = session[:data_type_id]

    if !@column_form.save
      @upload_msg = "System Problem"
    end

    @data_columns = DataColumn.find(:all, :conditions => ["upload_template_id = ?", @column_form.upload_template_id.to_i], :order => "seq_no")
---
SELECT * FROM `data_columns` WHERE (upload_template_id = 3) ORDER BY seq_no
UPDATE `data_columns` SET `updated_at` = '2010-09-20 18:24:48', `data_type_id` = 2, `data_type_name` = 'Home', `app_column` = 'street_1', `app_table` = 'addresses' WHERE `id` = 60
SELECT `data_columns`.id FROM `data_columns` WHERE (`data_columns`.`seq_no` = 3 AND `data_columns`.upload_template_id = 3 AND `data_columns`.id <> 57) LIMIT 1

  def process_file

    @upload_template = UploadTemplate.find(params[:id])
    @upload_template.status = "1"
    @upload_template.no_errors = 0
    @upload_template.notes = " "
    @data_columns = @upload_template.data_columns.find(:all, :order => "seq_no")
---
SELECT * FROM `upload_templates` WHERE (`upload_templates`.`id` = 4)
SELECT * FROM `data_columns` WHERE (`data_columns`.upload_template_id = 4) ORDER BY seq_no

      end

    @upload_template.status = "2"
    if !@upload_template.save
---
UPDATE `upload_templates` SET `updated_at` = '2010-09-20 17:57:14', `notes` = ' Phone update NOT successful:person_id = 1 AND phone_type_id = 2, enter 10 digits for phone number<br>Phone save NOT successful:person_id = 2 AND phone_type_id = 2, enter 10 digits for phone number<br>', `no_errors` = 2, `status` = '2' WHERE `id` = 4